{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_2", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-ae587147e637>\u00da\b<lambda>\b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activation": "linear", "nb_filter": 32, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "border_mode": "same", "name": "convolution2d_4", "bias": true, "W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [1, 1], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activation": "linear", "nb_filter": 64, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "border_mode": "same", "name": "convolution2d_5", "bias": true, "W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activation": "linear", "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "border_mode": "same", "name": "convolution2d_6", "bias": true, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_5", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 128, "b_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "bias": true, "W_constraint": null, "input_dim": 2048}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 128, "b_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "bias": true, "W_constraint": null, "input_dim": 128}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "name": "dense_3", "bias": true, "W_constraint": null, "input_dim": 128}}], "keras_version": "1.2.0"}